TexasInstruments/mspm0-sdk/examples/nortos/LP_MSPM0L1117/driverlib/empty_driverlib_src/ti/driverlib/dl_mcan.h
/*
 * Copyright (c) 2021, Texas Instruments Incorporated
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * *  Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 *
 * *  Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 *
 * *  Neither the name of Texas Instruments Incorporated nor the names of
 *    its contributors may be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,
 * THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
 * PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR
 * CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
 * EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS;
 * OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
 * WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR
 * OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */
/*!****************************************************************************
 *  @file       dl_mcan.h
 *  @brief      Modular Controller Area Network (MCAN) Driver Library
 *  @defgroup   MCAN Modular Controller Area Network (MCAN)
 *
 *  @anchor ti_dl_dl_mcan_Overview
 *  # Overview
 *
 *  The MCAN Driver Library allows full configuration of the MSPM0 MCAN (CAN-FD)
 *  module.
 *  The Modular Controller Area Network (MCAN) peripheral supports both
 *  communication through classic CAN and CAN-FD protocols.
 *
 *  <hr>
 ******************************************************************************
 */
/** @addtogroup MCAN
 * @{
 */
#ifndef ti_dl_dl_mcan__include
#define ti_dl_dl_mcan__include

#include <stdbool.h>
#include <stdint.h>

#include <ti/devices/msp/msp.h>
#include <ti/driverlib/dl_common.h>

#ifdef __MSPM0_HAS_MCAN__

#ifdef __cplusplus
extern "C" {
#endif

/* clang-format off */

/**
 *  @brief  Macro defines mask for all the interrupts status for MCAN.
 */
#define DL_MCAN_INTR_MASK_ALL (MCAN_IR_RF0N_MASK |                          \
                               MCAN_IR_RF0W_MASK |                          \
                               MCAN_IR_RF0F_MASK |                          \
                               MCAN_IR_RF0L_MASK |                          \
                               MCAN_IR_RF1N_MASK |                          \
                               MCAN_IR_RF1W_MASK |                          \
                               MCAN_IR_RF1F_MASK |                          \
                               MCAN_IR_RF1L_MASK |                          \
                               MCAN_IR_HPM_MASK  |                          \
                               MCAN_IR_TC_MASK   |                          \
                               MCAN_IR_TCF_MASK  |                          \
                               MCAN_IR_TFE_MASK  |                          \
                               MCAN_IR_TEFN_MASK |                          \
                               MCAN_IR_TEFW_MASK |                          \
                               MCAN_IR_TEFF_MASK |                          \
                               MCAN_IR_TEFL_MASK |                          \
                               MCAN_IR_TSW_MASK  |                          \
                               MCAN_IR_MRAF_MASK |                          \
                               MCAN_IR_TOO_MASK  |                          \
                               MCAN_IR_DRX_MASK  |                          \
                               MCAN_IR_BEU_MASK  |                          \
                               MCAN_IR_ELO_MASK  |                          \
                               MCAN_IR_EP_MASK   |                          \
                               MCAN_IR_EW_MASK   |                          \
                               MCAN_IR_BO_MASK   |                          \
                               MCAN_IR_WDI_MASK  |                          \
                               MCAN_IR_PEA_MASK  |                          \
                               MCAN_IR_PED_MASK  |                          \
                               MCAN_IR_ARA_MASK)

/**
 *  @brief  Maximum payload supported by CAn-FD protocol in bytes.
 */
#define DL_MCAN_MAX_PAYLOAD_BYTES                                          (64U)


/** @addtogroup DL_MCAN_INTERRUPT
 *  @{
 */
/*!
 * @brief Access to Reserved Address interrupt
 */
#define DL_MCAN_INTERRUPT_ARA                                 (MCAN_IR_ARA_MASK)

/*!
 * @brief Protocol Error in Data Phase interrupt
 */
#define DL_MCAN_INTERRUPT_PED                                 (MCAN_IR_PED_MASK)

/*!
 * @brief Protocol Error in Arbitration Phase interrupt
 */
#define DL_MCAN_INTERRUPT_PEA                                 (MCAN_IR_PEA_MASK)

/*!
 * @brief Watchdog interrupt
 */
#define DL_MCAN_INTERRUPT_WDI                                 (MCAN_IR_WDI_MASK)

/*!
 * @brief Bus_Off Status interrupt
 */
#define DL_MCAN_INTERRUPT_BO                                   (MCAN_IR_BO_MASK)

/*!
 * @brief Warning Status interrupt
 */
#define DL_MCAN_INTERRUPT_EW                                 (MCAN_IR_EW_MASK)

/*!
 * @brief Error Passive interrupt
 */
#define DL_MCAN_INTERRUPT_EP                                 (MCAN_IR_EP_MASK)

/*!
 * @brief Error Logging Overflow interrupt
 */
#define DL_MCAN_INTERRUPT_ELO                                 (MCAN_IR_ELO_MASK)

/*!
 * @brief Bit Error Uncorrected. Message RAM bit error detected, uncorrected interrupt
 */
#define DL_MCAN_INTERRUPT_BEU                                 (MCAN_IR_BEU_MASK)

/*!
 * @brief Message Stored to Dedicated Rx Buffer interrupt
 */
#define DL_MCAN_INTERRUPT_DRX                                 (MCAN_IR_DRX_MASK)

/*!
 * @brief Timeout Occurred interrupt
 */
#define DL_MCAN_INTERRUPT_TOO                                 (MCAN_IR_TOO_MASK)

/*!
 * @brief Message RAM Access Failure interrupt
 */
#define DL_MCAN_INTERRUPT_MRAF                               (MCAN_IR_MRAF_MASK)

/*!
 * @brief Timestamp Wraparound interrupt
 */
#define DL_MCAN_INTERRUPT_TSW                                 (MCAN_IR_TSW_MASK)

/*!
 * @brief Tx Event FIFO Element Lost interrupt
 */
#define DL_MCAN_INTERRUPT_TEFL                               (MCAN_IR_TEFL_MASK)

/*!
 * @brief Tx Event FIFO Full interrupt
 */
#define DL_MCAN_INTERRUPT_TEFF                               (MCAN_IR_TEFF_MASK)

/*!
 * @brief Tx Event FIFO Watermark Reached interrupt
 */
#define DL_MCAN_INTERRUPT_TEFW                               (MCAN_IR_TEFW_MASK)

/*!
 * @brief Tx Event FIFO New Entry interrupt
 */
#define DL_MCAN_INTERRUPT_TEFN                               (MCAN_IR_TEFN_MASK)

/*!
 * @brief Tx FIFO Empty interrupt
 */
#define DL_MCAN_INTERRUPT_TFE                                 (MCAN_IR_TFE_MASK)

/*!
 * @brief Transmission Cancellation Finished interrupt
 */
#define DL_MCAN_INTERRUPT_TCF                                 (MCAN_IR_TCF_MASK)

/*!
 * @brief Transmission Completed interrupt
 */
#define DL_MCAN_INTERRUPT_TC                                   (MCAN_IR_TC_MASK)

/*!
 * @brief High Priority Message interrupt
 */
#define DL_MCAN_INTERRUPT_HPM                                 (MCAN_IR_HPM_MASK)

/*!
 * @brief Rx FIFO 1 Message Lost interrupt
 */
#define DL_MCAN_INTERRUPT_RF1L                               (MCAN_IR_RF1L_MASK)

/*!
 * @brief Rx FIFO 1 Full interrupt
 */
#define DL_MCAN_INTERRUPT_RF1F                               (MCAN_IR_RF1F_MASK)

/*!
 * @brief Rx FIFO 1 Watermark Reached interrupt
 */
#define DL_MCAN_INTERRUPT_RF1W                               (MCAN_IR_RF1W_MASK)

/*!
 * @brief Rx FIFO 1 New Message interrupt
 */
#define DL_MCAN_INTERRUPT_RF1N                               (MCAN_IR_RF1N_MASK)

/*!
 * @brief Rx FIFO 0 Message Lost interrupt
 */
#define DL_MCAN_INTERRUPT_RF0L                               (MCAN_IR_RF0L_MASK)

/*!
 * @brief Rx FIFO 0 Full interrupt
 */
#define DL_MCAN_INTERRUPT_RF0F                               (MCAN_IR_RF0F_MASK)

/*!
 * @brief Rx FIFO 0 Watermark interrupt
 */
#define DL_MCAN_INTERRUPT_RF0W                               (MCAN_IR_RF0W_MASK)

/*!
 * @brief Rx FIFO 0 New Message interrupt
 */
#define DL_MCAN_INTERRUPT_RF0N                               (MCAN_IR_RF0N_MASK)

/** @}*/

/** @addtogroup DL_MCAN_MSP_INTERRUPT
 *  @{
 */
/*!
 * @brief Clock Stop Wake Up interrupt
 */
#define DL_MCAN_MSP_INTERRUPT_WAKEUP                     (MCAN_IMASK_WAKEUP_SET)

/*!
 * @brief External Timestamp Counter Overflow interrupt
 */
#define DL_MCAN_MSP_INTERRUPT_TIMESTAMP_OVERFLOW (MCAN_IMASK_EXT_TS_CNTR_OVFL_SET)

/*!
 * @brief Message RAM Double Error Detection interrupt
 */
#define DL_MCAN_MSP_INTERRUPT_DOUBLE_ERROR_DETECTION        (MCAN_IMASK_DED_SET)

/*!
 * @brief Message RAM Single Error Correction interrupt
 */
#define DL_MCAN_MSP_INTERRUPT_SINGLE_ERROR_CORRECTION       (MCAN_IMASK_SEC_SET)

/*!
 * @brief MCAN Interrupt Line 1
 */
#define DL_MCAN_MSP_INTERRUPT_LINE1                       (MCAN_IMASK_INTL1_SET)

/*!
 * @brief MCAN Interrupt Line 0
 */
#define DL_MCAN_MSP_INTERRUPT_LINE0                       (MCAN_IMASK_INTL0_SET)

/** @}*/

