TexasInstruments/mspm0-sdk/examples/nortos/LP_MSPM0L1117/driverlib/empty_driverlib_src/ti/driverlib/dl_mcan.h
    /*! 11bit MCAN Identifier */
    DL_MCAN_ID_TYPE_11_BIT = 0U,
    /*! 29bit MCAN Identifier */
    DL_MCAN_ID_TYPE_29_BIT = 1U

} DL_MCAN_ID_TYPE;

/**
 *  @brief   Enum to represent the MCAN mode of operation
 */
typedef enum {
    /*! MCAN normal mode */
    DL_MCAN_OPERATION_MODE_NORMAL = 0U,
    /*! MCAN SW initialization mode */
    DL_MCAN_OPERATION_MODE_SW_INIT = 1U

} DL_MCAN_OPERATION_MODE;

/**
 *  @brief   Enum to represent the MCAN Message RAM type.
 */
typedef enum {
    /*! MCAN Msg RAM buffers */
    DL_MCAN_MEM_TYPE_BUF = 0U,
    /*! MCAN Msg RAM FIFO/Queue */
    DL_MCAN_MEM_TYPE_FIFO = 1U

} DL_MCAN_MEM_TYPE;

/**
 *  @brief   Enum to represent the MCAN Rx FIFO number
 */
typedef enum {
    /*! MCAN Rx FIFO 0 */
    DL_MCAN_RX_FIFO_NUM_0 = 0U,
    /*! MCAN Rx FIFO 1 */
    DL_MCAN_RX_FIFO_NUM_1 = 1U
} DL_MCAN_RX_FIFO_NUM;

/**
 *  @brief   Enum to represent the MCAN pin type
 */
typedef enum {
    /*! MCAN Rx Pin */
    DL_MCAN_PIN_TYPE_RX = 0U,
    /*! MCAN Tx Pin */
    DL_MCAN_PIN_TYPE_TX = 1U
} DL_MCAN_PIN_TYPE;

/**
 *  @brief   Enum to represent FIFO/Buffer element Size
 */
typedef enum {
    /*! 8 byte data field */
    DL_MCAN_ELEM_SIZE_8BYTES = 0U,
    /*! 12 byte data field */
    DL_MCAN_ELEM_SIZE_12BYTES = 1U,
    /*! 16 byte data field */
    DL_MCAN_ELEM_SIZE_16BYTES = 2U,
    /*! 20 byte data field */
    DL_MCAN_ELEM_SIZE_20BYTES = 3U,
    /*! 24 byte data field */
    DL_MCAN_ELEM_SIZE_24BYTES = 4U,
    /*! 32 byte data field */
    DL_MCAN_ELEM_SIZE_32BYTES = 5U,
    /*! 48 byte data field */
    DL_MCAN_ELEM_SIZE_48BYTES = 6U,
    /*! 64 byte data field */
    DL_MCAN_ELEM_SIZE_64BYTES = 7U
} DL_MCAN_ELEM_SIZE;

/**
 *  @brief   Enum to represent the MCAN time-out counter configuration
 */
typedef enum {
    /*! Continuous operation Mode */
    DL_MCAN_TIMEOUT_SELECT_CONT = 0U,
    /*! Timeout controlled by Tx Event FIFO */
    DL_MCAN_TIMEOUT_SELECT_TX_EVENT_FIFO = 1U,
    /*! Timeout controlled by Rx FIFO 0 */
    DL_MCAN_TIMEOUT_SELECT_RX_FIFO0 = 2U,
    /*! Timeout controlled by Rx FIFO 1 */
    DL_MCAN_TIMEOUT_SELECT_RX_FIFO1 = 3U

} DL_MCAN_TIMEOUT_SELECT;

/**
 *  @brief   Enum to select the MCAN instance
 */
typedef enum {
    /*! MCAN interrupt source was triggered by external time stamp*/
    DL_MCAN_INTR_SRC_MCAN_EXT_TS = 0x0,
    /*! MCAN interrupt source was triggered by Line 0 */
    DL_MCAN_INTR_SRC_MCAN_LINE_0 = 0x1,
    /*! MCAN interrupt source was triggered by Line 1 */
    DL_MCAN_INTR_SRC_MCAN_LINE_1 = 0x2,
} DL_MCAN_INTR_SRC_MCAN;

/**
 *  @brief   Enum to represent the ECC Error Types
 */
typedef enum {
    /*! ECC Single Error Correction */
    DL_MCAN_ECC_ERR_TYPE_SEC = 0U,
    /*! ECC Single Error Detection */
    DL_MCAN_ECC_ERR_TYPE_DED = 1U

} DL_MCAN_ECC_ERR_TYPE;

/**
 *  @brief   Enum to select the MCAN Loopback mode
 */
typedef enum {
    /*! Internal Loop Back Mode
     *   This mode can be used for hot self-test and this mode will not
     *   affect bus state.
     */
    DL_MCAN_LPBK_MODE_INTERNAL = 0U,
    /*! External Loop Back Mode
    *   In this mode, MCAN the M_CAN treats its own
    *   transmitted messages as
    *   received messages and stores them (if they
    *   pass acceptance filtering)
    *   into an Rx Buffer or an Rx FIFO.
    *   This mode will affect bus state
    */
    DL_MCAN_LPBK_MODE_EXTERNAL = 1U

} DL_MCAN_LPBK_MODE;

/**
 *  @brief   Enum to represent MCAN's communication state
 */
typedef enum {
    /*! MCAN is synchronizing on CAN communication */
    DL_MCAN_COM_STATE_SYNCHRONIZING = 0U,
    /*! MCAN is neither receiver nor transmitter */
    DL_MCAN_COM_STATE_IDLE = 1U,
    /*! MCAN is operating as receiver */
    DL_MCAN_COM_STATE_RECEIVER = 2U,
    /*! MCAN is operating as transmitter */
    DL_MCAN_COM_STATE_TRANSMITTER = 3U
} DL_MCAN_COM_STATE;

/**
 *  @brief   Enum to represent MCAN's Error Code
 */
typedef enum {
    /*! No error occurred since LEC has been reset by
     *   successful reception or transmission.
     */
    DL_MCAN_ERR_CODE_NO_ERROR = 0U,
    /*! More than 5 equal bits in a sequence have occurred in a part of
     *   a received message where this is not allowed.
     */
    DL_MCAN_ERR_CODE_STUFF_ERROR = 1U,
    /*! A fixed format part of a received frame has the wrong format. */
    DL_MCAN_ERR_CODE_FORM_ERROR = 2U,
    /*! The message transmitted by the M_CAN was not acknowledged
     *   by another node.
     */
    DL_MCAN_ERR_CODE_ACK_ERROR = 3U,
    /*! During the transmission of a message (with the exception of
     *   the arbitration field), the device wanted to send a
     *   recessive level (bit of logical value 1),
     *  but the monitored bus value was dominant.
     */
    DL_MCAN_ERR_CODE_BIT1_ERROR = 4U,
    /*! During the transmission of a message (or acknowledge bit,
     *   or active error flag, or overload flag), the device wanted to send
     *   a dominant level (data or identifier bit logical value 0),
     *   but the monitored bus value was recessive. During Bus_Off recovery
     *   this status is set each time a sequence of 11 recessive bits has been
     *   monitored. This enables the CPU to monitor the proceeding of
     *   the Bus_Off recovery sequence (indicating the bus is not stuck at
     *   dominant or continuously disturbed).
     */
    DL_MCAN_ERR_CODE_BIT0_ERROR = 5U,
    /*! The CRC check sum of a received message was incorrect.
     *   The CRC of an incoming message does not match with the
     *   CRC calculated from the received data.
     */
    DL_MCAN_ERR_CODE_CRC_ERROR = 6U,
    /*! Any read access to the Protocol Status Register re-initializes
     * the LEC to 7. When the LEC shows the value 7,no CAN bus event was
     * detected since the last CPU read access to the Protocol Status Register.
     */
    DL_MCAN_ERR_CODE_NO_CHANGE = 7U

} DL_MCAN_ERR_CODE;

/**
 *  @brief  Structure for CANCLK configuration.
 */
typedef struct {
    /*! Specifies the clock source for MCAN_FCLK (CANCLK). One of
        @ref DL_MCAN_FCLK */
    DL_MCAN_FCLK clockSel;
    /*! Specifies clock divider for CANCLK. One of @ref DL_MCAN_FCLK_DIV */
    DL_MCAN_FCLK_DIV divider;
} DL_MCAN_ClockConfig;

/**
 *  @brief  Structure for bit timing calculation.
 *         Bit timing related to data phase will be valid only in case where
 *         MCAN is put in CAN-FD mode and will be '0' otherwise.
 */
typedef struct {
    /*! Nominal Baud Rate Pre-scaler
     *   Range:[0x0-0x1FF]
     */
    uint32_t nomRatePrescalar;
    /*! Nominal Time segment before sample point
     *   Range:[0x0-0xFF]
     */
    uint32_t nomTimeSeg1;
    /*! Nominal Time segment after sample point
     *   Range:[0x0-0x7F]
     */
    uint32_t nomTimeSeg2;
    /*! Nominal (Re)Synchronization Jump Width
     *   Range:[0x0-0x7F]
     */
    uint32_t nomSynchJumpWidth;
    /*! Data Baud Rate Pre-scaler
     *   Range:[0x0-0x1F]
     */
    uint32_t dataRatePrescalar;
    /*! Data Time segment before sample point
     *   Range:[0x0-0x1F]
     */
    uint32_t dataTimeSeg1;
    /*! Data Time segment after sample point
     *   Range:[0x0-0xF]
     */
    uint32_t dataTimeSeg2;
    /*! Data (Re)Synchronization Jump Width
     *   Range:[0x0-0xF]
     */
    uint32_t dataSynchJumpWidth;
} DL_MCAN_BitTimingParams;

/**
 *  @brief  Structure for MCAN Transmitter Delay Compensation parameters.
 */
typedef struct {
    /*! Transmitter Delay Compensation Filter Window Length
     *   Range:[0x0-0x7F]
     */
    uint32_t tdcf;
    /*! Transmitter Delay Compensation Offset
     *   Range:[0x0-0x7F]
     */
    uint32_t tdco;
} DL_MCAN_TDCConfig;

/**
 *  @brief  Structure for MCAN Global Filter Configuration parameters.
 */
typedef struct {
    /*! Reject Remote Frames Extended
     *   0 = Filter remote frames with 29-bit extended IDs
     *   1 = Reject all remote frames with 29-bit extended IDs
     */
    uint32_t rrfe;
    /*! Reject Remote Frames Standard
     *   0 = Filter remote frames with 11-bit standard IDs
     *   1 = Reject all remote frames with 11-bit standard IDs
     */
    uint32_t rrfs;
    /*! Accept Non-matching Frames Extended
     *   0 = Accept in Rx FIFO 0
     *   1 = Accept in Rx FIFO 1
     *   others = Reject
     */
    uint32_t anfe;
    /*! Accept Non-matching Frames Standard
     *   0 = Accept in Rx FIFO 0
     *   1 = Accept in Rx FIFO 1
     *   others = Reject
     */
    uint32_t anfs;
} DL_MCAN_GlobalFiltConfig;

/**
 *  @brief  Structure for MCAN initialization parameters.
 */
typedef struct {
    /*! CAN-FD Operation Enable
     *   0 = FD operation disabled (Operates in CAN Classic mode)
     *   1 = FD operation enabled
     */
    uint32_t fdMode;
    /*! Bit Rate Switch Enable
     *   This is valid only when CAN-FD operation is enabled (fdMode = 1).
     *   0 = Bit rate switching for transmissions disabled
     *   1 = Bit rate switching for transmissions enabled
     */
    uint32_t brsEnable;
    /*! Transmit Pause. MCAN pauses for two CAN bit times before starting the
     *  next transmission after itself has successfully transmitted a frame
     *   0 = Transmit pause disabled
     *   1 = Transmit pause enabled
     */
    uint32_t txpEnable;
    /*! Edge Filtering during Bus Integration
     *   0 = Edge filtering disabled
     *   1 = Two consecutive dominant tq required to detect an edge for
     *       hard synchronization
     */
    uint32_t efbi;
    /*! Protocol Exception Handling. When protocol exception handling is
     *  disabled, the MCAN will transmit an error frame when it detects a
     *  protocol exception condition.
     *   0 = Protocol exception handling enabled
     *   1 = Protocol exception handling disabled
     */
    uint32_t pxhddisable;
    /*! Disable Automatic Retransmission
     *   0 = Automatic retransmission of messages not transmitted successfully
     *       enabled
     *   1 = Automatic retransmission disabled
     */
    uint32_t darEnable;
    /*! Wakeup Request Enable
     *   0 = Wakeup request is disabled
     *   1 = Wakeup request is enabled
     */
    uint32_t wkupReqEnable;
    /*! Auto-Wakeup Enable
     *   0 = Auto-Wakeup is disabled
     *   1 = Auto-Wakeup is enabled
     */
    uint32_t autoWkupEnable;
    /*! Emulation/Debug Suspend Enable
     *   0 = Emulation/Debug Suspend is disabled
     *   1 = Emulation/Debug Suspend is enabled
     */
    uint32_t emulationEnable;
    /*! Start value of the Message RAM Watchdog Counter
     *   Range:[0x0-0xFF]
     */
    uint32_t wdcPreload;
    /*! Transmitter Delay Compensation parameters.
     *   @ref DL_MCAN_TDCConfig.
     */
    DL_MCAN_TDCConfig tdcConfig;
    /*! Transmitter Delay Compensation Enable
     *   0 = Transmitter Delay Compensation is disabled
     *   1 = Transmitter Delay Compensation is enabled
     */
    uint32_t tdcEnable;
} DL_MCAN_InitParams;

/**
 *  @brief  Structure for MCAN configuration parameters.
 */
typedef struct {
    /*! Bus Monitoring Mode
     *   0 = Bus Monitoring Mode is disabled
     *   1 = Bus Monitoring Mode is enabled
     */
    uint32_t monEnable;
    /*! Restricted Operation Mode
     *   0 = Normal CAN operation
     *   1 = Restricted Operation Mode active
     *   This mode should not be combined with test modes.
     */
    uint32_t asmEnable;
    /*! Timestamp Counter Prescaler.
     *   Range:[0x0-0xF]
     */
    uint32_t tsPrescalar;
    /*! Timestamp source selection.
     *   00= Timestamp counter value always 0x0000
     *   01= Timestamp counter value incremented according to tsPrescalar
     *   10= External timestamp counter value used
     *   11= Same as 0b00
     */
    uint32_t tsSelect;
    /*! Time-out counter source select.
     *   One of @ref DL_MCAN_TIMEOUT_SELECT.
     */
    uint32_t timeoutSelect;
    /*! Start value of the Timeout Counter (down-counter).
     *   The Timeout Counter is decremented in multiples of CAN bit times [1-16]
     *   depending on the configuration of the tsPrescalar.
     *   Range:[0x0-0xFFFF]
     */
    uint32_t timeoutPreload;
    /*! Time-out Counter Enable
     *   0 = Time-out Counter is disabled
     *   1 = Time-out Counter is enabled
     */
    uint32_t timeoutCntEnable;
    /*! Global Filter Configuration parameters.
     *    @ref DL_MCAN_GlobalFiltConfig.
     */
    DL_MCAN_GlobalFiltConfig filterConfig;
} DL_MCAN_ConfigParams;

/**
 *  @brief  Structure for MCAN error logging counters status.
 */
typedef struct {
    /*! Transmit Error Counter */
    uint32_t transErrLogCnt;
    /*! Receive Error Counter */
    uint32_t recErrCnt;
    /*! Receive Error Passive
     *   0 = The Receive Error Counter is below the error passive level(128)
     *   1 = The Receive Error Counter has reached the error passive level(128)
     */
    uint32_t rpStatus;
    /*! CAN Error Logging */
    uint32_t canErrLogCnt;
} DL_MCAN_ErrCntStatus;

/**
 *  @brief  Structure for MCAN protocol status.
 */
typedef struct {
    /*! Last Error Code
     *   One of @ref DL_MCAN_ERR_CODE
     */
    uint32_t lastErrCode;
    /*! Activity - Monitors the module's CAN communication state.
     *   One of @ref DL_MCAN_COM_STATE
     */
    uint32_t act;
    /*! Error Passive
     *   0 = The M_CAN is in the Error_Active state
     *   1 = The M_CAN is in the Error_Passive state
     */
    uint32_t errPassive;
    /*! Warning Status
     *   0 = Both error counters are below the Error_Warning limit of 96
     *   1 = At least one of error counter has reached the Error_Warning
     *       limit of 96
     */
    uint32_t warningStatus;
    /*! Bus_Off Status
     *   0 = The M_CAN is not Bus_Off
     *   1 = The M_CAN is in Bus_Off state
     */
    uint32_t busOffStatus;
    /*! Data Phase Last Error Code
     *   One of @ref DL_MCAN_ERR_CODE
     */
    uint32_t dlec;
    /*! ESI flag of last received CAN FD Message
     *   0 = Last received CAN FD message did not have its ESI flag set
     *   1 = Last received CAN FD message had its ESI flag set
     */
    uint32_t resi;
    /*! BRS flag of last received CAN FD Message
     *   0 = Last received CAN FD message did not have its BRS flag set
     *   1 = TLast received CAN FD message had its BRS flag set
     */
    uint32_t rbrs;
    /*! Received a CAN FD Message
     *   0 = Since this bit was reset by the CPU, no CAN FD message has been
     *       received
     *   1 = Message in CAN FD format with FDF flag set has been received
     */
    uint32_t rfdf;
    /*! Protocol Exception Event
     *   0 = No protocol exception event occurred since last read access
     *   1 = Protocol exception event occurred
     */
    uint32_t pxe;
    /*! Transmitter Delay Compensation Value */
    uint32_t tdcv;
} DL_MCAN_ProtocolStatus;

/**
 *  @brief  Structure for MCAN Message RAM Configuration Parameters.
 *         Message RAM can contain following sections:
 *         Standard ID filters, Extended ID filters, TX FIFO(or TX Q),
 *         TX Buffers, TX EventFIFO, RX FIFO0, RX FIFO1, RX Buffer.
 *         Note: If particular section in the RAM is not used then it's size
 *         should be initialized to '0'
 *         (Number of buffers in case of Tx/Rx buffer).
 */
typedef struct {
    /*! Standard ID Filter List Start Address */
    uint32_t flssa;
    /*! List Size: Standard ID
     *   0 = No standard Message ID filter
     *   1-127 = Number of standard Message ID filter elements
     *   others = Values greater than 128 are interpreted as 128
     */
    uint32_t lss;
    /*! Extended ID Filter List Start Address */
    uint32_t flesa;
    /*! List Size: Extended ID
     *   0 = No standard Message ID filter
     *   1-64 = Number of standard Message ID filter elements
     *   others = Values greater than 64 are interpreted as 64
     */
    uint32_t lse;
    /*! Tx Buffers Start Address */
    uint32_t txStartAddr;
    /*! Number of Dedicated Transmit Buffers
     *   0 = No Dedicated Tx Buffers
     *   1-32 = Number of Dedicated Tx Buffers
     *   others = Values greater than 32 are interpreted as 32
     */
    uint32_t txBufNum;
    /*! Transmit FIFO/Queue Size
     *   0 = No Tx FIFO/Queue
     *   1-32 = Number of Tx Buffers used for Tx FIFO/Queue
     *   others = Values greater than 32 are interpreted as 32
     */
    uint32_t txFIFOSize;
    /*! Tx FIFO/Queue Mode
     *   0 = Tx FIFO operation
     *   1 = Tx Queue operation
     */
    uint32_t txBufMode;
    /*! Tx Buffer Element Size */
    uint32_t txBufElemSize;
    /*! Tx Event FIFO Start Address */
    uint32_t txEventFIFOStartAddr;
    /*! Event FIFO Size
     *   0 = Tx Event FIFO disabled
     *   1-32 = Number of Tx Event FIFO elements
     *   others = Values greater than 32 are interpreted as 32
     */
    uint32_t txEventFIFOSize;
    /*! Tx Event FIFO Watermark
     *   0 = Watermark interrupt disabled
     *   1-32 = Level for Tx Event FIFO watermark interrupt
     *   others = Watermark interrupt disabled
     */
    uint32_t txEventFIFOWaterMark;
    /*! Rx FIFO0 Start Address */
    uint32_t rxFIFO0startAddr;
    /*! Rx FIFO0 Size
     *   0 = No Rx FIFO
     *   1-64 = Number of Rx FIFO elements
     *   others = Values greater than 64 are interpreted as 64
     */
    uint32_t rxFIFO0size;
    /*! Rx FIFO0 Watermark
     *   0 = Watermark interrupt disabled
     *   1-63 = Level for Rx FIFO 0 watermark interrupt
     *   others = Watermark interrupt disabled
     */
    uint32_t rxFIFO0waterMark;
    /*! Rx FIFO0 Operation Mode
     *   0 = FIFO blocking mode
     *   1 = FIFO overwrite mode
     */
    uint32_t rxFIFO0OpMode;
    /*! Rx FIFO1 Start Address */
    uint32_t rxFIFO1startAddr;
    /*! Rx FIFO1 Size
     *   0 = No Rx FIFO
     *   1-64 = Number of Rx FIFO elements
     *   others = Values greater than 64 are interpreted as 64
     */
    uint32_t rxFIFO1size;
    /*! Rx FIFO1 Watermark
     *   0 = Watermark interrupt disabled
     *   1-63 = Level for Rx FIFO 1 watermark interrupt
     *   others = Watermark interrupt disabled
     */
    uint32_t rxFIFO1waterMark;
    /*! Rx FIFO1 Operation Mode
     *   0 = FIFO blocking mode
     *   1 = FIFO overwrite mode
     */
    uint32_t rxFIFO1OpMode;
    /*! Rx Buffer Start Address */
    uint32_t rxBufStartAddr;
    /*! Rx Buffer Element Size */
    uint32_t rxBufElemSize;
    /*! Rx FIFO0 Element Size */
    uint32_t rxFIFO0ElemSize;
    /*! Rx FIFO1 Element Size */
    uint32_t rxFIFO1ElemSize;
} DL_MCAN_MsgRAMConfigParams;

/**
 *  @brief  Structure for MCAN High Priority Message.
 */
typedef struct {
    /*! Buffer Index
     *   Only valid when MSI[1] = 1.
     */
    uint32_t bufIdx;
    /*! Message Storage Indicator
     *   MSI[1:0]
     *       00  = No FIFO selected
     *       01  = FIFO message lost
     *       10  = Message stored in FIFO 0
     *       11  = Message stored in FIFO 1
     */
    uint32_t msi;
    /*! Filter Index */
    uint32_t filterIdx;
    /*! Indicates the filter list of the matching filter element
     *   0 = Standard Filter List
     *   1 = Extended Filter List
     */
    uint32_t filterList;
} DL_MCAN_HighPriorityMsgInfo;

/**
 *  @brief  Structure for MCAN new data flag for Rx buffer.
 */
typedef struct {
    /*! New data flag for Rx buffer no. 0 to 31 */
    uint32_t statusLow;
    /*! New data flag for Rx buffer no. 32 to 63 */
    uint32_t statusHigh;
} DL_MCAN_RxNewDataStatus;

/**
 *  @brief  Structure for MCAN Rx FIFO Status.
 */
typedef struct {
    /*! Rx FIFO number
     *   One of @ref DL_MCAN_RX_FIFO_NUM
     */
    uint32_t num;
    /*! Rx FIFO Fill Level */
    uint32_t fillLvl;
    /*! Rx FIFO Get Index */
    uint32_t getIdx;
    /*! Rx FIFO Put Index */
    uint32_t putIdx;
    /*! Rx FIFO Full
     *   0 = Rx FIFO not full
     *   1 = Rx FIFO full
     */
    uint32_t fifoFull;
    /*! Rx FIFO Message Lost */
    uint32_t msgLost;
} DL_MCAN_RxFIFOStatus;

/**
 *  @brief  Structure for MCAN Tx FIFO Status.
 */
typedef struct {
    /*! Tx FIFO Free Level */
    uint32_t freeLvl;
    /*! Tx FIFO Get Index
     *   Read as zero when Tx Queue operation is configured.
     */
    uint32_t getIdx;
    /*! Tx FIFO/Queue Put Index */
    uint32_t putIdx;
    /*! Tx FIFO/Queue Full
     *   0 = Tx FIFO/Queue not full
     *   1 = Tx FIFO/Queue full
     */
    uint32_t fifoFull;
} DL_MCAN_TxFIFOStatus;

/**
 *  @brief  Structure for MCAN Tx Event FIFO Status.
 */
typedef struct {
    /*! Event FIFO Fill Level */
    uint32_t fillLvl;
    /*! Event FIFO Gut Index */
    uint32_t getIdx;
    /*! Event FIFO Put Index */
    uint32_t putIdx;
    /*! Event FIFO Full
     *   0 = Tx Event FIFO not full
     *   1 = Tx Event FIFO full
     */
    uint32_t fifoFull;
    /*! Tx Event FIFO Element Lost
     *   0 = No Tx Event FIFO element lost
     *   1 = Tx Event FIFO element lost, also set after write attempt to
     *       Tx Event FIFO of size zero.
     */
    uint32_t eleLost;
} DL_MCAN_TxEventFIFOStatus;

/**
 *  @brief  Structure for ECC Error forcing.
 */
typedef struct {
    /*! Error type to be forced
     *   Refer enum  #DL_MCAN_ECC_ERR_TYPE.
     */
    uint32_t errType;
    /*! Row address where error needs to be applied. */
    uint32_t rowNum;
    /*! Column/Data bit that needs to be flipped when
     *   force_sec or force_ded is set
     */
    uint32_t bit1;
    /*! Data bit that needs to be flipped when force_ded is set */
    uint32_t bit2;
    /*! Force Error once
     *   1: The error will inject an error to the specified row only once
     */
    uint32_t errOnce;
    /*! Force error on the next RAM read */
    uint32_t errForce;
} DL_MCAN_ECCErrForceParams;

/**
 *  @brief  Structure for ECC Error Status.
 */
typedef struct {
    /*! Single Bit Error Status
     *   0 = No Single Bit Error pending
     *   1 = Single Bit Error pending
     */
    uint32_t secErr;
    /*! Double Bit Error Status
     *   0 = No Double Bit Error pending
     *   1 = Double Bit Error pending
     */
    uint32_t dedErr;
    /*! Indicates the row/address where the single or double bit
     *   error occurred.
     */
    uint32_t row;
    /*! Indicates the bit position in the ram data that is in error */
    uint32_t bit1;

} DL_MCAN_ECCErrStatus;

/**
 *  @brief  Structure for accessing Revision ID and Core Release Info.
 *         of MCAN module.
 */
typedef struct {
    /*! Scheme */
    uint32_t scheme;
    /*! Module ID */
    uint32_t modId;
    /*! Major revision */
    uint32_t major;
    /*! Minor revision */
    uint32_t minor;
    /*! Time Stamp Day. Two digits, BCD-coded. */
    uint32_t day;
    /*! Time Stamp Month. Two digits, BCD-coded. */
    uint32_t mon;
    /*! Time Stamp Year. Single digit, BCD-coded. */
    uint32_t year;
    /*! Sub-step of Core Release Single digit, BCD-coded. */
    uint32_t subStep;
    /*! Step of Core Release.Two digits, BCD-coded Single digit, BCD-coded. */
    uint32_t step;
    /*! Core Release. Single digit, BCD-coded. */
    uint32_t rel;
} DL_MCAN_RevisionId;

/**
 *  @brief  Structure for accessing Revision ID of ECC AGGR.
 */
typedef struct {
    /*! Scheme */
    uint32_t scheme;
    /*! Module ID */
    uint32_t modId;
    /*! Major revision */
    uint32_t major;
    /*! Minor revision */
    uint32_t minor;
} DL_MCAN_ECCAggrRevisionId;

/**
 *  @brief  Structure for MCAN ECC configuration parameters.
 */
typedef struct {
    /*! Enable/disable ECC
     *   0 = Disable ECC
     *   1 = Enable ECC
     */
    uint32_t enable;
    /*! Enable/disable ECC Check
     *   0 = Disable ECC Check
     *   1 = Enable ECC Check
     */
    uint32_t enableChk;
    /*! Enable/disable Read Modify Write operation
     *   0 = Disable Read Modify Write operation
     *   1 = Enable Read Modify Write operation
     */
    uint32_t enableRdModWr;
} DL_MCAN_ECCConfigParams;

